StandardNet(
  (pe): PositionalEmbedding(level=6, include_input=True)
  (triplane): TriPlaneEmbedding(resolution=32, channel=2)
  (net): Sequential(
    (0): Linear(in_features=45, out_features=96, bias=True)
    (1): ReLU()
    (2): Linear(in_features=96, out_features=16, bias=True)
    (3): ReLU()
    (4): Linear(in_features=16, out_features=48, bias=True)
    (5): ReLU()
    (6): Linear(in_features=48, out_features=64, bias=True)
    (7): ELU(alpha=1.0)
    (8): Linear(in_features=64, out_features=1, bias=True)
    (9): Sigmoid()
  )
)size=16519