StandardNet(
  (pre_process): PreProcessList(
    in_features=3
    (processes): ModuleList(
      (0): PositionalEmbedding(in_features=3, level=6, include_input=True)
      (1): TriPlaneEmbedding(type=grid, mode=cat)
    )
  )
  (main_net): BaseNet(
    (module_list): ModuleList(
      (0): Linear(in_features=45, out_features=64, bias=True)
      (1): ELU(alpha=1.0)
      (2): Linear(in_features=64, out_features=128, bias=True)
      (3): Swish()
      (4): Linear(in_features=128, out_features=128, bias=True)
      (5): ELU(alpha=1.0)
      (6): Linear(in_features=128, out_features=96, bias=True)
      (7): Swish()
      (8): Linear(in_features=96, out_features=48, bias=True)
      (9): ReLU()
      (10): Linear(in_features=48, out_features=16, bias=True)
      (11): ReLU()
      (12): Linear(in_features=16, out_features=1, bias=True)
    )
  )
  (post_process): Sigmoid()
)size=52151