StandardNet(
  (pe): PositionalEmbedding(level=6, include_input=True)
  (triplane): TriPlaneEmbedding(resolution=32, channel=2)
  (net): Sequential(
    (0): Linear(in_features=45, out_features=128, bias=True)
    (1): Swish()
    (2): Linear(in_features=128, out_features=48, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=48, out_features=64, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=64, out_features=64, bias=True)
    (7): ReLU()
    (8): Linear(in_features=64, out_features=32, bias=True)
    (9): ELU(alpha=1.0)
    (10): Linear(in_features=32, out_features=16, bias=True)
    (11): Swish()
    (12): Linear(in_features=16, out_features=1, bias=True)
    (13): Sigmoid()
  )
)size=28535