StandardNet(
  (pe): PositionalEmbedding(level=6, include_input=True)
  (triplane): TriPlaneEmbedding(resolution=32, channel=2)
  (net): Sequential(
    (0): Linear(in_features=45, out_features=40, bias=True)
    (1): ReLU()
    (2): Linear(in_features=40, out_features=8, bias=True)
    (3): ReLU()
    (4): Linear(in_features=8, out_features=40, bias=True)
    (5): Swish()
    (6): Linear(in_features=40, out_features=16, bias=True)
    (7): ELU(alpha=1.0)
    (8): Linear(in_features=16, out_features=32, bias=True)
    (9): ELU(alpha=1.0)
    (10): Linear(in_features=32, out_features=16, bias=True)
    (11): ELU(alpha=1.0)
    (12): Linear(in_features=16, out_features=1, bias=True)
    (13): Sigmoid()
  )
)size=10807